БылковД.А_70180166/src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаПересдачу</name>
  <basedOn>Document.ИдентификацияАкадемическихЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ИдентификацияАкадемическихЗадолженностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Documents/НаправлениеНаПересдачу/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.НаправлениеНаПересдачу.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаправлениеНаПересдачу.Аудитория,
	|	НаправлениеНаПересдачу.Группа,
	|	НаправлениеНаПересдачу.Дата,
	|	НаправлениеНаПересдачу.ДатаПроведения,
	|	НаправлениеНаПересдачу.Дисциплина,
	|	НаправлениеНаПересдачу.Курс,
	|	НаправлениеНаПересдачу.ЛичныйИндекс,
	|	НаправлениеНаПересдачу.НаименованиеКонтроля,
	|	НаправлениеНаПересдачу.НаправленияПодготовки,
	|	НаправлениеНаПересдачу.Номер,
	|	НаправлениеНаПересдачу.Основание,
	|	НаправлениеНаПересдачу.Преподаватель,
	|	НаправлениеНаПересдачу.Студент,
	|	НаправлениеНаПересдачу.Факультет,
	|	НаправлениеНаПересдачу.ФормаОбучения
	|ИЗ
	|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
	|ГДЕ
	|	НаправлениеНаПересдачу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
